{"pages":[{"title":"Episode Nineteen: Global Game Jam","text":"The 19th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie gives you a pep talk about Global Game Jam! Length: 8 minutes Listen Now MP3 OGG Links Global Game Jam","tags":"Podcast","url":"episode-nineteen-global-game-jam.html"},{"title":"Episode Eighteen: New Year, Who Dis?","text":"The 18th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about welcoming the new year with big plans and small steps. Length: 45 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-eighteen-new-year-who-dis.html"},{"title":"Episode Seventeen: Sharing is Caring","text":"The 17th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin share resources and inspirations. Length: 33 minutes Links Lost Decade Podcast Ask Gamedev YouTube Channel Gamasutra Blogs TIGSource DevLogs Story Studio Podcast Writing Excuses We Know The Devil Analogue: A Hate Story Impro: Improvisation and the Theatre Quiest: The Power of Introverts in a World that Can't Stop Talking Listen Now MP3 OGG","tags":"Podcast","url":"episode-seventeen-sharing-is-caring.html"},{"title":"Episode Sixteen: Slither Into Gamedev with Python","text":"The 16th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the Python programming language, a language both have worked with for many years and enjoy quite a lot. Also, a language with a long and complicated relationship with making games, for better or for worse. Length: 33 minutes Links Python PyGame PyWeek RenPy PursuedPyBear Listen Now MP3 OGG","tags":"Podcast","url":"episode-sixteen-slither-into-gamedev-with-python.html"},{"title":"Episode Fifteen: Hurt Me Plenty","text":"The 15th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about difficulty levels in games. What changes in gameplay make compelling knobs to adjust the challenge? How do we balance our games not just once, but across many difficulty levels? Length: 27 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-fifteen-hurt-me-plenty.html"},{"title":"Episode Fourteen: Interview: Henry Keiser","text":"The 14th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie interviews Henry Keiser about his work in VR. Length: 55 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-fourteen-interview-henry-keiser.html"},{"title":"Episode Thirteen: Gamdev Daily Grind","text":"The 13th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the difficulty working on your game every day, and weigh the benefits of working a little every day vs a whole lot on just a couple days each week. Length: 32 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-thirteen-gamdev-daily-grind.html"},{"title":"Episode Twelve: Jammin' 'Bout Game Jams","text":"The 12th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about game jam events. Ludam Dare Itch.io Game Jame Listings Length: 32 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-twelve-jammin-bout-game-jams.html"},{"title":"Episode Eleven: Initial Project Management","text":"The 11th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about the initial efforts to organize a new project and get your planning and tracking off to a good start. Initial project setup with timelines and outlines FogBugz Trello OneNote Remember the Milk <https://www.rememberthemilk.com/ >_ Bullet Journals Morning Pages and the Artist's Way Prototyping as planning Timelines, whether you'll stick to them or not Timeboxing Agile Development MVPs Cohesive Development Iterations Length: 32 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-eleven-initial-project-management.html"},{"title":"Episode Ten: The One About Dev Updates","text":"The 10th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about dev updates, screenshot Saturdays, and all the ways gamedevs share their work and progress. Talked about tools we make and if they are worth the time, mentioned XKCD chart Calvin talks about planning for Necromancer's Escape Screen Shot Saturdays Itch.io Dev Log Feature TigSource DevLogs Forum Pacing content teased through updates We mention Overwatch and Slay the Spire, again, of course. Length: 33 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-ten-the-one-about-dev-updates.html"},{"title":"Episode Nine: Castle in the Sky","text":"The 9th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin interview Ayla Myers, part of the team behind Castle.games , the web-based community for building and sharing games online. They've built a platform where their users can build LÖVE 2D games and play them all on the their web-based platform. Find Alya on Twitter @bridgs_dev or on her website . Length: 41 minutes Listen Now MP3 OGG","tags":"Podcast","url":"episode-nine-castle-in-the-sky.html"},{"title":"Episode Eight: Niche or Itch","text":"The 8th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about choosing between building games in the same genre or style, or exploring many different ideas, especially with the limited time hobbyists have to spend on making their games. We also talk about some of our favorite indie developers. Length: 31 minutes Listen Now MP3 OGG Topics Finding a niche Reusing work between projects Limited time owch.itch.io lorenschmidt.itch.io Jeff Vogel of Spiderweb Software Christine Love","tags":"Podcast","url":"episode-eight-niche-or-itch.html"},{"title":"Episode Seven: Marie Kondo and the Life Changing Magic of Reducing Scope","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Jaycie and Calvin talk about Marie Kondo's and the Life Changing Magic of Reducing Scope, I mean, of Tidying Up. Same thing, right? We take a bunch of select quotes and lessons from the popular book and see how we can or do apply them to the practice of making games. This epsiode is about an hour. Listen Now MP3 OGG Topics Marie Kondo's The Life-Changing Magic of Tidying Up We talk about minimalism We talk about reducing scope","tags":"Podcast","url":"episode-seven-marie-kondo-and-the-life-changing-magic-of-reducing-scope.html"},{"title":"Episode Six: Failure to Launch","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! In this episode Calvin and Jaycie recount a dozen games between the two of them which they've never finished, their feelings on not finishing games, and intents to revisist past projects or to set them aside forever to focus on better things. NOTE : We had some recording issues at the start of this episode. Apologies for the low quality on Calvin's end. The issue is resolved a few minutes in, so please hang in there! Listen Now MP3 OGG Topics Neon Den We talk about simplifying difficult game features to move past them \"I accidentally a career in web development\" Project S.C.O.R.P.I.O.N. Axe Princess Working with friends... Or not The mythical exception that is The Lone Solo Game Developer 30 Days to 30 Warrior's Farce Trying to finish games before life milestones (turning 30, etc.) The Last Patient Viking of Love Game Jams and being motivated by them vs being motivated for them 100 Floors, or Tower of Treasure Trying to make a very simple game just to finish a game Read Write Retribution MongoDB, the database that makes mugs Games as art projects Seed Magic Oasis Station Strawberry Jam Deep Deep Labyrinth Crystal Beast Tarrask","tags":"Podcast","url":"episode-six-failure-to-launch.html"},{"title":"Episode Five: Willpower Doesn't Work","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Work is going great for both of us The book, Willpower Doesn't Work, is reviewed Making pubic commitments to keep honest Choice Quotes \"Frustrating is not the same as challenging\" \"If you want to write, you've got to read\"","tags":"Podcast","url":"episode-five-willpower-doesnt-work.html"},{"title":"Episode Four: Foolishness","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","tags":"Podcast","url":"episode-four-foolishness.html"},{"title":"Episode Three: What a Tool","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","tags":"Podcast","url":"episode-three-what-a-tool.html"},{"title":"Episode Two: Burnout","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Recent project updates Burnout over the years Combatting burnout The cycle of lack-of-energy and building habits back","tags":"Podcast","url":"episode-two-burnout.html"},{"title":"Episode One: The Journey Begins","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Letting go of projects Games that aren't puzzles but can be described as puzzles Working a collection of games as a game Time boxing drawings to get over artist's block Prepping for a new job, balancing with hobbies Using game dev time as excuse to your neglect inbox Overwatch Destiny 2 Mastermind Groups Hoplite Into The Breach The life changing manga of cleaning up Mazes for Programmers","tags":"Podcast","url":"episode-one-the-journey-begins.html"}]}