{"pages":[{"tags":"Podcast","url":"episode-thirty-nine-developers-who-inspire-us.html","text":"The 39th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about game developers who inspire us. Length: 75 minutes Show Notes (Pending.) Listen Now MP3 OGG","title":"Episode Thirty-Nine: Developers Who Inspire Us"},{"tags":"Podcast","url":"episode-thirty-eight-bonsai-games.html","text":"The 38th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about \"bonsai games\", the small and concise experience that fit in your pocket. Length: 50 minutes Listen Now MP3 OGG","title":"Episode Thirty-Eight: Bonsai Games"},{"tags":"Podcast","url":"episode-thirty-seven-gamedev-for-its-own-sake.html","text":"The 37th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about enjoying gamedev just for its own sake. Length: 46 minutes Listen Now MP3 OGG","title":"Episode Thirty-Seven: Gamedev For Its Own Sake"},{"tags":"Podcast","url":"episode-thirty-six-done.html","text":"The 36th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about choosing when to call things \"done\". Length: 48 minutes Listen Now MP3 OGG","title":"Episode Thirty-Six: Done!"},{"tags":"Podcast","url":"episode-thirty-five-second-heather-flowers-interview.html","text":"The 35th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie welcome Heather Flowers back to the podcast for another conversation. Length: 38 minutes Listen Now MP3 OGG Show Notes http://www.blackgamedevs.com/ Bundle for Racial Justice and Equality Black Lives Matter Support Bundle Heather's Itch.io Page Heather's Patreon","title":"Episode Thirty-Five: Second Heather Flowers Interview"},{"tags":"Podcast","url":"episode-thirty-four-code-vs-content.html","text":"The 34th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about the balance between code and content in the design and impementation of making games. Length: 38 minutes Listen Now MP3 OGG","title":"Episode Thirty-Four: Code vs Content"},{"tags":"Podcast","url":"episode-thirty-third-what-did-you-think-about-my-feedback.html","text":"The 33rd episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about giving, receiving, and asking for feedback. Length: 46 minutes Listen Now MP3 OGG Show Notes Jaycie is seeking beta readers on their Patreon We talk about game dev communities on Discord ( join ours! ) Google Forms can be used to prompt and standardize feedback from earlier play testers Feedback is something you need to practice taking! Never Split The Difference When giving advice, make sure you understand what kind of feedback is needed. Balance feedback with personal preference and goals, especially for indie or hobbyist games. Keep Going","title":"Episode Thirty-Third: What Did You Think About My Feedback?"},{"tags":"Podcast","url":"episode-thirty-second-look-at-me-look-at-me.html","text":"The 32st episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about self promotion of your games. Length: 49 minutes Listen Now MP3 OGG Indie Dev Log of the Week Ben of Dev Duck is our very first Indie Dev Log of the Week. Check out his excellent videos as he works on his game, Dauphin! Show Notes Learn about Calvin's new game, Last Stand of the Mushroom, by watching the first Dev Update video or reading the post Bang Ban Conference Using MIDI controllers to tweak gameplay The Last Emperox She-Ra and the Princesses of Power Latest Murderbot book, Network Effect Void Bastards Scrap Mechanic TIGSource DevLogs Seed Magic Risk of Rain 2 The Rule of Seven Get in the Car Loser We mention Jaycie's Game Jam Notes and shared them if you're interested","title":"Episode Thirty-Second: Look at Me! Look at Me!"},{"tags":"Podcast","url":"episode-thirty-first-bitter-jam-post-mortem.html","text":"The 31st episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about success and failure of participation in Bitter Jam 2020. Length: 59 minutes Listen Now MP3 OGG Show Notes Bitter Jam Mini Jam Ludam Dare","title":"Episode Thirty-First: Bitter Jam Post-Mortem"},{"tags":"Podcast","url":"episode-thirty-why-do-we-want-to-make-games.html","text":"The 30th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie try to answer the question for themselves \"Why Do We Want To Make Games?\" Length: 59 minutes Listen Now MP3 OGG Show Notes Omnus 7 Hypercard Apple II Basic","title":"Episode Thirty: Why Do We Want To Make Games?"},{"tags":"Podcast","url":"episode-twenty-nine-interview-with-victoria-dominowski.html","text":"The 29th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie interview Victoria Dominowski about her game Secret Little Haven. Length: 53 minutes Listen Now MP3 OGG Show Notes Victoria Dominowski on the web https://ristar.itch.io/ https://twitter.com/QuestForTori What have we been enjoying? JC Risk of Rain 2 Animal Crossing Derek Siver's Anything You Could Want Calvin Locke & Key The Last Emperox Collapsing Empire Trilogy Victoria Spyro the Dragon Remaster DragonQuest Builders II Secret Little Haven About a trans girl in egg-mode exploring gender through fan forums for her favorite Magical Girl Show Built a complete OS underneath the game inside which the story takes place References Humble 7000 Icons Bundle HyperCard Secret Mew Mario Artist Polygon Studio Anthrotari Ren'Py","title":"Episode Twenty-Nine: Interview with Victoria Dominowski"},{"tags":"Podcast","url":"episode-twenty-eight-on-the-road-again.html","text":"The 28th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie discuss the use of travel in game design. Length: 55 minutes Show Notes Mario Cart and F-Zero racing games FFVII and other RPG world maps Quick Travel in Morrowind and World of Warcraft Castlevania: SotN key rooms The Final Fantasy XV road trip Oregon Trail Concretely, the game Journey Abstractly, the concept of The Hero's Journey Get in the Car, Loser Desert Bus Minecraft EVE Online Listen Now MP3 OGG","title":"Episode Twenty-Eight: On The Road Again"},{"tags":"Podcast","url":"episode-twenty-seven-interview-with-piper-thunstrom.html","text":"The 27th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie interview Piper Thunstrom , the creator and maintainer of the PursuedPyBear Python game engine. Length: 55 minutes Show Notes We talk about... - The PursuedPyBear game engine - The principles behind which a software project is designed - Extracting engines, libraries, and tooling from existing projects - The stagnation of the Python game development ecosystem - Education in Python and through game development - Pygame - PySDL2 - Design Patterns Book - All Things Open Conference - Wanderers by Chuck Wendig Listen Now MP3 OGG","title":"Episode Twenty-Seven: Interview with Piper Thunstrom"},{"tags":"Podcast","url":"episode-twenty-six-getting-back-on-track-during-covid-19.html","text":"The 26th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about the emotional impact of the COVID-19 pandemic and getting back on track in these difficult times. Length: 35 minutes Show Notes If you are depressed or need help, get the help you need Adjust your time and budget, ease back in Don't try to catch up, just try to get moving again! Be willing to accept changing timelines Returning from a break is a riskier time for burnout, so take it easier Use the opportunity to reasses. Are some of the tasks less fun? Do you need to change plans or scopes? Is this the game for you? You might like the game idea, it might be a great game, but is it the game for you? Listen Now MP3 OGG","title":"Episode Twenty-Six: Getting Back on Track During COVID-19"},{"tags":"Podcast","url":"episode-twenty-five-interview-with-ray-perry.html","text":"The 24th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin interview fellow side quester Ray Perry. Ray works with Jaycie during the day and works on his own games in his side time. We talk about the games that inspire ray and his dream project. Length: 42 minutes Show Notes Calvin is playing the FFVII Demo and Shadow of the Colossus Jaycie is playing Overwatch again and reading Delicious in Dungeon and My Hero Academia Ray is playing Hades and watching Keep Your Hands Off Eizouken Ray talks about Dept. Heaven , a series of games inspiring his big passion project We talk a lot about Dept. Heaven's Episode 5, Knights of the Nightmare , which Ray manages to describe as a \"Tactical Bingo Bullet-hell\" Jaycie and Calvin praise Story Cubes Ray talks about the game Roundguard , describing it as Peggle crossed with an RPG We briefly mention the strange dating sims Hatoful Boyfriend and My Horse Prince Calvin and Ray recall the unique game Boktai: The Sun Is in Your Hand Ray talks about the Meditations game collection, which he contributed to Jaycie mentions The Longing , a game that literally takes 400 days to complete We also mention in this episode Chroma Squad , Auto Chess , and the Python game engine PursuedPyBear Listen Now MP3 OGG","title":"Episode Twenty-Five: Interview with Ray Perry"},{"tags":"Podcast","url":"episode-twenty-four-prioritizing-gamedev-tasks.html","text":"The 24rd episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about prioritizing tasks. Length: 33 minutes Listen Now MP3 OGG Show Notes If your game is a passion project, where just adding anything is the fun, prioritization will be different Most important in deadline driven projects that need to finish to ship Prioritization could be for specific milestones, events, opportunities Important goal for prioritization: \"purchasable\" Prioritize integration (steam) over optional or extra content Marketing events could be prioritized as part of the deadline pressure, prioritization touches all areas Linear progress of game may not map to actual priorities Jaycie says \"Build levels 1, 5, then 3\" Calvin says \"Build levels 3, 0, then -1\" Some times, you can prioritize for your own motivation and reward feedback Jaycie mentions the \"I Should Be Writing\" podcast Figuring out an ending helped to move Jaycie's project forward Don't let asset quality hold you back Remember, Kirby was originally a placeholder! This week, Calvin has been reading/watching/playing: * Spell/Sword * Why Are We Yelling * Star Trek Discovery and Picard * Kipo * Maisel * Raft Jaycie has been reading/playing/watching * Season 3 of Castlevania * \"Never Split The Difference\"","title":"Episode Twenty-Four: Prioritizing Gamedev Tasks"},{"tags":"Podcast","url":"episode-twenty-three-the-one-about-pokemon.html","text":"The 23rd episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the influence of Pokemon on game design. Length: 40 minutes Listen Now MP3 OGG Show Notes Everyone knows pokemon, huge connection to game design over the years Indie developers make the same game over and over Make a game jam game, remake as a full game. Refining Pokemon game made over and over Don't be afraid to iterate Similar to chapter based games Infinite updates create a similar feedback loop Story Studio Podcast","title":"Episode Twenty-Three: The One About Pokemon"},{"tags":"Podcast","url":"episode-twenty-two-interview-with-heather-flowers.html","text":"The 22th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin interview indie developer Heather Flowers, maker fo EXTREME MEATPUNKS FOREVER Length: 47 minutes Listen Now MP3 OGG","title":"Episode Twenty-Two: Interview with Heather Flowers"},{"tags":"Podcast","url":"episode-twenty-one-game-updates-for-february-2020.html","text":"The 21st episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin give updates on their main game projects, Anthrotari and Necromancer's Escape. Length: 23 minutes Listen Now MP3 OGG","title":"Episode Twenty-One: Game Updates for February 2020"},{"tags":"Podcast","url":"episode-twenty-first-year-look-back.html","text":"The 20th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the first episode of Side Quest Completed and what's changed since then. Length: 32 minutes Listen Now MP3 OGG","title":"Episode Twenty: First Year Look Back"},{"tags":"Podcast","url":"episode-nineteen-global-game-jam.html","text":"The 19th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie gives you a pep talk about Global Game Jam! Length: 8 minutes Listen Now MP3 OGG Links Global Game Jam","title":"Episode Nineteen: Global Game Jam"},{"tags":"Podcast","url":"episode-eighteen-new-year-who-dis.html","text":"The 18th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about welcoming the new year with big plans and small steps. Length: 45 minutes Listen Now MP3 OGG","title":"Episode Eighteen: New Year, Who Dis?"},{"tags":"Podcast","url":"episode-seventeen-sharing-is-caring.html","text":"The 17th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin share resources and inspirations. Length: 33 minutes Links Lost Decade Podcast Ask Gamedev YouTube Channel Gamasutra Blogs TIGSource DevLogs Story Studio Podcast Writing Excuses We Know The Devil Analogue: A Hate Story Impro: Improvisation and the Theatre Quiest: The Power of Introverts in a World that Can't Stop Talking Listen Now MP3 OGG","title":"Episode Seventeen: Sharing is Caring"},{"tags":"Podcast","url":"episode-sixteen-slither-into-gamedev-with-python.html","text":"The 16th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the Python programming language, a language both have worked with for many years and enjoy quite a lot. Also, a language with a long and complicated relationship with making games, for better or for worse. Length: 33 minutes Links Python PyGame PyWeek RenPy PursuedPyBear Listen Now MP3 OGG","title":"Episode Sixteen: Slither Into Gamedev with Python"},{"tags":"Podcast","url":"episode-fifteen-hurt-me-plenty.html","text":"The 15th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about difficulty levels in games. What changes in gameplay make compelling knobs to adjust the challenge? How do we balance our games not just once, but across many difficulty levels? Length: 27 minutes Listen Now MP3 OGG","title":"Episode Fifteen: Hurt Me Plenty"},{"tags":"Podcast","url":"episode-fourteen-interview-henry-keiser.html","text":"The 14th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie interviews Henry Keiser about his work in VR. Length: 55 minutes Listen Now MP3 OGG","title":"Episode Fourteen: Interview: Henry Keiser"},{"tags":"Podcast","url":"episode-thirteen-gamdev-daily-grind.html","text":"The 13th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about the difficulty working on your game every day, and weigh the benefits of working a little every day vs a whole lot on just a couple days each week. Length: 32 minutes Listen Now MP3 OGG","title":"Episode Thirteen: Gamdev Daily Grind"},{"tags":"Podcast","url":"episode-twelve-jammin-bout-game-jams.html","text":"The 12th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about game jam events. Ludam Dare Itch.io Game Jame Listings Length: 32 minutes Listen Now MP3 OGG","title":"Episode Twelve: Jammin' 'Bout Game Jams"},{"tags":"Podcast","url":"episode-eleven-initial-project-management.html","text":"The 11th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Calvin and Jaycie talk about the initial efforts to organize a new project and get your planning and tracking off to a good start. Initial project setup with timelines and outlines FogBugz Trello OneNote Remember the Milk <https://www.rememberthemilk.com/ >_ Bullet Journals Morning Pages and the Artist's Way Prototyping as planning Timelines, whether you'll stick to them or not Timeboxing Agile Development MVPs Cohesive Development Iterations Length: 32 minutes Listen Now MP3 OGG","title":"Episode Eleven: Initial Project Management"},{"tags":"Podcast","url":"episode-ten-the-one-about-dev-updates.html","text":"The 10th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about dev updates, screenshot Saturdays, and all the ways gamedevs share their work and progress. Talked about tools we make and if they are worth the time, mentioned XKCD chart Calvin talks about planning for Necromancer's Escape Screen Shot Saturdays Itch.io Dev Log Feature TigSource DevLogs Forum Pacing content teased through updates We mention Overwatch and Slay the Spire, again, of course. Length: 33 minutes Listen Now MP3 OGG","title":"Episode Ten: The One About Dev Updates"},{"tags":"Podcast","url":"episode-nine-castle-in-the-sky.html","text":"The 9th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin interview Ayla Myers, part of the team behind Castle.games , the web-based community for building and sharing games online. They've built a platform where their users can build LÖVE 2D games and play them all on the their web-based platform. Find Alya on Twitter @bridgs_dev or on her website . Length: 41 minutes Listen Now MP3 OGG","title":"Episode Nine: Castle in the Sky"},{"tags":"Podcast","url":"episode-eight-niche-or-itch.html","text":"The 8th episode of the Side Quest Completed podcast, a podcast about game development hobbies. Jaycie and Calvin talk about choosing between building games in the same genre or style, or exploring many different ideas, especially with the limited time hobbyists have to spend on making their games. We also talk about some of our favorite indie developers. Length: 31 minutes Listen Now MP3 OGG Topics Finding a niche Reusing work between projects Limited time owch.itch.io lorenschmidt.itch.io Jeff Vogel of Spiderweb Software Christine Love","title":"Episode Eight: Niche or Itch"},{"tags":"Podcast","url":"episode-seven-marie-kondo-and-the-life-changing-magic-of-reducing-scope.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Jaycie and Calvin talk about Marie Kondo's and the Life Changing Magic of Reducing Scope, I mean, of Tidying Up. Same thing, right? We take a bunch of select quotes and lessons from the popular book and see how we can or do apply them to the practice of making games. This epsiode is about an hour. Listen Now MP3 OGG Topics Marie Kondo's The Life-Changing Magic of Tidying Up We talk about minimalism We talk about reducing scope","title":"Episode Seven: Marie Kondo and the Life Changing Magic of Reducing Scope"},{"tags":"Podcast","url":"episode-six-failure-to-launch.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! In this episode Calvin and Jaycie recount a dozen games between the two of them which they've never finished, their feelings on not finishing games, and intents to revisist past projects or to set them aside forever to focus on better things. NOTE : We had some recording issues at the start of this episode. Apologies for the low quality on Calvin's end. The issue is resolved a few minutes in, so please hang in there! Listen Now MP3 OGG Topics Neon Den We talk about simplifying difficult game features to move past them \"I accidentally a career in web development\" Project S.C.O.R.P.I.O.N. Axe Princess Working with friends... Or not The mythical exception that is The Lone Solo Game Developer 30 Days to 30 Warrior's Farce Trying to finish games before life milestones (turning 30, etc.) The Last Patient Viking of Love Game Jams and being motivated by them vs being motivated for them 100 Floors, or Tower of Treasure Trying to make a very simple game just to finish a game Read Write Retribution MongoDB, the database that makes mugs Games as art projects Seed Magic Oasis Station Strawberry Jam Deep Deep Labyrinth Crystal Beast Tarrask","title":"Episode Six: Failure to Launch"},{"tags":"Podcast","url":"episode-five-willpower-doesnt-work.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Work is going great for both of us The book, Willpower Doesn't Work, is reviewed Making pubic commitments to keep honest Choice Quotes \"Frustrating is not the same as challenging\" \"If you want to write, you've got to read\"","title":"Episode Five: Willpower Doesn't Work"},{"tags":"Podcast","url":"episode-four-foolishness.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","title":"Episode Four: Foolishness"},{"tags":"Podcast","url":"episode-three-what-a-tool.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","title":"Episode Three: What a Tool"},{"tags":"Podcast","url":"episode-two-burnout.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Recent project updates Burnout over the years Combatting burnout The cycle of lack-of-energy and building habits back","title":"Episode Two: Burnout"},{"tags":"Podcast","url":"episode-one-the-journey-begins.html","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Letting go of projects Games that aren't puzzles but can be described as puzzles Working a collection of games as a game Time boxing drawings to get over artist's block Prepping for a new job, balancing with hobbies Using game dev time as excuse to your neglect inbox Overwatch Destiny 2 Mastermind Groups Hoplite Into The Breach The life changing manga of cleaning up Mazes for Programmers","title":"Episode One: The Journey Begins"}]}