{"pages":[{"title":"Episode Six: Failure to Launch","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Neon Den We talk about simplifying difficult game features to move past them \"I accidentally a career in web development\" Project S.C.O.R.P.I.O.N. Axe Princess Working with friends... Or not The mythical exception that is The Lone Solo Game Developer 30 Days to 30 Warrior's Farce Trying to finish games before life milestones (turning 30, etc.) The Last Patient Viking of Love Game Jams and being motivated by them vs being motivated for them 100 Floors, or Tower of Treasure Trying to make a very simple game just to finish a game Read Write Retribution MongoDB, the database that makes mugs Games as art projects Seed Magic Oasis Station Strawberry Jam Deep Deep Labyrinth Crystal Beast Tarrask Choice Quotes \"Frustrating is not the same as challenging\" \"If you want to write, you've got to read\"","tags":"Podcast","url":"episode-six-failure-to-launch.html"},{"title":"Episode Five: Willpower Doesn't Work","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Work is going great for both of us The book, Willpower Doesn't Work, is reviewed Making pubic commitments to keep honest Choice Quotes \"Frustrating is not the same as challenging\" \"If you want to write, you've got to read\"","tags":"Podcast","url":"episode-five-willpower-doesnt-work.html"},{"title":"Episode Four: Foolishness","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","tags":"Podcast","url":"episode-four-foolishness.html"},{"title":"Episode Three: What a Tool","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics We talk about way too many TV shows Jerry Seinfield's \"don't break the chain\" calendar The pomodoro technique Putting personal stories into your games Practicing marketing by failing repeatedly The Storyshot Podcast PICO8 RenPy Unity Test && Commit || Revert Morning Pages","tags":"Podcast","url":"episode-three-what-a-tool.html"},{"title":"Episode Two: Burnout","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Recent project updates Burnout over the years Combatting burnout The cycle of lack-of-energy and building habits back","tags":"Podcast","url":"episode-two-burnout.html"},{"title":"Episode One: The Journey Begins","text":"Welcome to Side Quest Completed, the gamedev hobby podcast! Listen Now MP3 OGG Topics Letting go of projects Games that aren't puzzles but can be described as puzzles Working a collection of games as a game Time boxing drawings to get over artist's block Prepping for a new job, balancing with hobbies Using game dev time as excuse to your neglect inbox Overwatch Destiny 2 Mastermind Groups Hoplite Into The Breach The life changing manga of cleaning up Mazes for Programmers","tags":"Podcast","url":"episode-one-the-journey-begins.html"}]}